case_channel/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../input.txt"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{


    outlet
    {
        type            fixedValue;//fixedJump;
        value           uniform $pout;
    }

    wall
    {
        type            fixedFluxPressure;//fixedJump;
    }


    inlet 	
    {
        type            fixedValue;
        value           uniform $pin;
    }

    bottom
    {
        type            fixedFluxPressure;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
